todoData =[
     {
        id:Math.random(),
        name:"God of War",
        description:"God of War est une série de jeux vidéo d'action-aventure de type beat them all débutée en 2005, développée par SIE Santa Monica Studio et produite par Sony Computer Entertainment",
        pic:"https://image.api.playstation.com/vulcan/ap/rnd/202207/1210/4xJ8XB3bi888QTLZYdl7Oi0s.png",
        prix:"60$",
        rating: 5,
        trailer:"",
        watched:false,
    },
    {
        id:Math.random(),
        name:"Uncherted 4",
        description:"Uncharted 4: A Thief's End est un jeu vidéo d'action-aventure développé par Naughty Dog et édité par Sony. Il s'agit du quatrième opus de la série de jeux vidéo Uncharted. Il a été officiellement annoncé le 15 novembre 2013 et est sorti sur PlayStation 4 le 10 mai 2016",
        pic:"https://upload.wikimedia.org/wikipedia/en/1/1a/Uncharted_4_box_artwork.jpg",
        prix:"80$",
        rating: 5,
        trailer:"",
        watched:false,
    },
    {
        id:Math.random(),
        name:"Pes 2023",
        description:"eFootball est un jeu vidéo de simulation de football associatif développé et édité par Konami. Il s'agit d'un jeu gratuit après avoir été complètement renommé de la série originale Pro Evolution Soccer à la série eFootball. La première année du jeu, intitulée eFootball 2022, est sortie le 30 septembre 2021",
        pic:"https://www.konami.com/kde_cms/eu_publish/uploads/ef2022-kv_1920x1080-600x338.jpg",
        prix:"70$",
        rating:5,
        trailer:"",
        watched:false,
    },
    {
        id:Math.random(),
        name:"Assassin's Creed Mirage",
        description:"Assassin's Creed Mirage est un jeu vidéo d'action-aventure et d'infiltration développé par Ubisoft Bordeaux et édité par Ubisoft. Sa sortie est prévue en 2023 sur Windows, PlayStation 4, PlayStation 5, Xbox One, Xbox Series et Amazon Luna. Il est le treizième opus canonique de la série Assassin's Creed.",
        pic:"https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/44OIxbe6JrPpo64Yela76A/30411af74bf62868426867766886ae4c/acmirage-homescreen-bg-desktop.jpg",
        prix:"110$",
        trailer:"",
        rating:3,
        watched:false,
    },
    {
        id:Math.random(),
        name:"FIFA 23",
        description:"FIFA 23 est un jeu vidéo de simulation de football développé par EA Vancouver et édité par Electronic Arts. Il s'agit du 30ᵉ volet de la série FIFA. Il est sorti sur Microsoft Windows, Nintendo Switch, PlayStation 4, PlayStation 5, Xbox One, Xbox Series et Google Stadia le 30 septembre 2022",
        pic:"https://m.media-amazon.com/images/I/81ef53W7PlL.jpg",
        prix:"200$",
        rating:4,
        trailer:"",
        watched:false,
    },
    {
        id:Math.random(),
        name:"The Callisto Protocol",
        description:"The Callisto Protocol est un jeu vidéo d'horreur à la troisième personne développé par Striking Distance Studios, fondé par Glen Schofield, co-créateur de la série Dead Space. Il est sorti le 2 décembre 2022 sur Microsoft Windows, PlayStation 4, PlayStation 5, Xbox One et Xbox Series.",
        pic:"https://assets-prd.ignimgs.com/2022/06/03/the-callisto-protocol-1654266829372.jpg",
        prix:"90$",
        rating:2,
        trailer:"",
        watched:false,

    },
    {
        id:Math.random(),
        name:"Call of Duty: Modern Warfare II",
        description:"Call of Duty: Modern Warfare II est un jeu vidéo de tir à la première personne développé par le studio Infinity Ward, et édité par Activision. Dévoilé le 28 avril 2022, il est sorti le 28 octobre 2022 sur Microsoft Windows, PlayStation 4, PlayStation 5, Xbox One et Xbox Series",
        pic:"https://hardware31.tech/wp-content/uploads/2022/06/call-of-duty-modern-warfare-2-warzone-2-0-se-devoile-couverture.jpg",
        prix:"150$",
        rating:4,
        trailer:"",
        watched:false,

    },
    {
        id:Math.random(),
        name:"Horizon Forbidden West",
        description:"Horizon Forbidden West est un jeu vidéo d'action-RPG développé par Guerrilla Games et publié par Sony Interactive Entertainment, sorti le 18 février 2022 sur PlayStation 4 et PlayStation 5. Il s'agit de la suite d’Horizon Zero Dawn et relate des événements se déroulant six mois après.",
        pic:"https://image.jeuxvideo.com/medias-sm/163293/1632927582-7714-jaquette-avant.gif",
        prix:"40$",
        rating:3,
        trailer:"",
        watched:false,

    },
    {
        id:Math.random(),
        name:"Elden Ring",
        description:"",
        pic:"",
        prix:"",
        rating:1,
        trailer:"",
        watched:false,

    },
    {
        id:Math.random(),
        name:"Marvel's Spider-Man (Spider-Man",
        description:"Marvel's Spider-Man est un jeu vidéo d'action développé par Insomniac Games et édité par Sony Interactive Entertainment en collaboration avec Marvel, sorti le 7 septembre 2018 sur la console PlayStation 4 puis sur PlayStation 5 le 12 novembre 2020. Un portage du jeu sur PC est sorti le 12 août 2022",
        pic:"https://m.media-amazon.com/images/I/51uB0JJrjzS._AC_.jpg",
        prix:"90$",
        rating:5,
        trailer:"",
        watched:false,

    },
    {
        id:Math.random(),
        name:"Red Dead Redemption II",
        description:"Red Dead Redemption II est un jeu vidéo d'action-aventure en monde ouvert et de western multiplateforme, développé par Rockstar Studios et édité par Rockstar Games, sorti le 26 octobre 2018 sur PlayStation 4 et Xbox One et le 5 novembre 2019 sur Windows. Une version Stadia est également sortie le 19 novembre 2019",
        pic:"https://media.rockstargames.com/rockstargames-newsite/uploads/d5c7e4dcecb612368aee64978f183250b6e643fe.jpg",
        prix:"60$",
        rating:3,
        trailer:"",
        watched:false,

    },
    {
        id:Math.random(),
        name:"Resident Evil 2",
        description:"Resident Evil 2 est un jeu vidéo d'horreur en vue à la troisième personne développé et édité par Capcom, sorti le 25 janvier 2019 sur Microsoft Windows, PlayStation 4 et Xbox One. La 4K, les 60 images par seconde et le HDR sont compatibles sur Microsoft Windows et sur les consoles Xbox One X et PS4 Pro.",
        pic:"https://upload.wikimedia.org/wikipedia/en/thumb/f/fd/Resident_Evil_2_Remake.jpg/220px-Resident_Evil_2_Remake.jpg",
        prix:"30$",
        rating:5,
        trailer:"",
        watched:false,

    },
]
